Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagsAttributes.TagA1 Property
 The tag A1 of a mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewMarkTagAttributes TagA1 { get; set; }
Public Property TagA1 As View.ViewMarkTagAttributes
	Get
	Set
Property Value
Type: View.ViewMarkTagAttributes
See Also
Reference
View.ViewMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace